import React, { Component } from 'react';
import { Login, Absence } from '../components';

class AbsenteeismStudentPage extends Component{
   render() {

      const absence = [
         ['Математика', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Укр Мова', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Англійська', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Музика', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Малювання', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Інформатика', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Математика', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Укр Мова', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Англійська', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Музика', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Малювання', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]],
         ['Інформатика', [['01.04', 'н'], ['02.04', 'н'], ['03.04', 'н']]]
         
      ]

      return (
         <div>
            { this.props.isLoginned ?  
            <div className='absenteesmPage'>
               <h2>Пропуски</h2>
               <div className="group">
                  <h3 className='predm'>Предмет</h3>
                  <h3 className='missed'>Пропуски</h3>
               </div>
               <div className="absence">
                  {absence.map((absen) => <Absence predm={absen[0]} abs={absen[1]} />)}
               </div>

            </div> : (<Login />)}
         </div>
      );
   }
}

export default AbsenteeismStudentPage;
