import React, { Component } from 'react';
import { Login, Post } from '../components'

class Homepage extends Component {

   

   render() {
      const posts = [
         [1, 'Всеукраїнський відкритий марафон з української мови', "Державна наукова установа «Інститут модернізації змісту освіти» спільно з ТОВ «Х’юман» провела ІІ Всеукраїнський відкритий марафон з української мови. Метою змагання був розвиток в учнівської та студентської молоді стійкої мотивації й свідомого прагнення до вивчення української мови, формування компетентностей комунікативно, доцільно й виправдано користуватися засобами мови в різних життєвих ситуаціях і сферах спілкування. Учасниками Марафону були студенти нашого коледжу (Евеліна Іванюш – ДЗ-11, Андрій Боцко – ПК-22, Христина Савуляк – ДВ-11), котрі отримали почесні місця та були нагороджені сертифікатами. Керівник – Роксолана Яцків."],
         [2, 'Барвінкова,веселкова, найдорожча рідна мова', 'Володимир Сосюра, пророчо мовив: «Без мови рідної й народу рідного нема». Українській мова творець духовного відродження української нації, духовного світу людини.'],
         [3, 'Всеукраїнська інтернет-олімпіада “Всеосвіта зима 2021-2022” з англійської мови', "У рамках проведення Всеукраїнської інтернет-олімпіади\n” Всеосвіта зима 2021-2022″ з англійської мови , члени гуртка англійської мови ДМТФК не тільки взяли участь, але й стали переможцями:\n1 місце – Чава Роман (ПК-22)\n2 місце – Ясюра Максим (ПК-22), Мороз Вероніка (ДЗ-21) Банішевська Олександра (ПК-22)\n3 місце – Мазур Назар(ЕК-21)\nСертифікати учасників олімпіади отримали:\nМакух Софія(ДЗ-21), Садова Христина (ПК-22), Чень Віктор (ПК-22), Демко Оксана (БО-21),Федькович Вероніка (БО-21), Літянська Христина (БО-21), Марків Вероніка (БО-21), Петречко Софія (БО-21), Юрків Віталій (ПК-21), Мінчак Максим (ПК-21)\nВітаємо переможців, учасників та наставників Андрійчик Ольгу Богданівну та Бандрівську Наталію Михайлівну!!! Бажаємо нових досягнень і перемог! Ви молодці!!! Пишаємося!"]
   ]
      return (
         
         <div className='HomePage'>
            { this.props.isLoginned ?  <div>
                  <div className="pageContent">
                     <div className="main">
                        <h1>ДРОГОБИЦЬКИЙ МЕХАНІКО-ТЕХНОЛОГІЧНИЙ ФАХОВИЙ КОЛЕДЖ</h1>
                     </div>
                     <div className="posts">
                        {posts.map((post) => <Post title={post[1]} text={post[2]}/>)}
                     </div>
                  </div>
               </div> : (<Login />)}
         </div>
      );
   }
}

export default Homepage;
