import React, { Component } from 'react';
import { Login, HomeTask } from '../components'

class Hometaskstudentpage extends Component {
   render() {
      const tasks = [
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні'],
         ['Математика', 'Номери: 213, 215', '21.03', 'Так'],
         ['Укр Мова', 'Параграф: 21', '24.03', 'Ні']
      ]
      return (
         <div className='HometaskPage'>
            { this.props.isLoginned ?  <div>
                  <h2>Домашнє Завдання</h2>
                  <div className="group">
                     <h3 className='predm'>Предмет</h3>
                     <h3 className='zav'>Завдання</h3>
                     <h3 className='date'>Дата здачі</h3>
                     <h3 className='missed'>Пропущено</h3>
                  </div>
                  <div className="tasks">
                     {tasks.map((task) => <HomeTask predm={task[0]} zav={task[1]} date={task[2]} missed={task[3]} />)}
                  </div>
               </div> : (<Login />)}
         </div>
      );
   }
}

export default Hometaskstudentpage;
