import React, { Component } from 'react';
import { Login, GroupTimeTable } from '../components';
import Link from 'react-scroll/modules/components/Link';

class Timetablestudentpage extends Component {
   render() {

      const timeTable = 
      [
         [1, [
               ['ОР-11', 
                  [
                     ['Понеділок', ['1. -----', '2. Біологія', '3. Хімія', '4. Математика']],
                     ['Вівторок', ['1. Укр Мова', '2. Економічна теорія', '3. Математика', '4. Інформ. та комп. тех.']],
                     ['Середа', ['1. Історія України', '2. Всесвітня історія', '3. Фізика', '4. Захист України']],
                     ['Четвер', ['1. Укр Літ', '2. Креслення', '3. Фізкульт./Зах. України']],
                     ['П\'ятниця', ['1. Основи правознавства', '2. Фізкультура', '3. Заруб. Літ', '4. Анг. Мова']]
                  ]
               ],
               ['ЕК-11', 
                  [
                     ['Понеділок', ['1. Матем/Іст. України', '2. Анг. Мова', '3. Креслення', '4. Фізкульт./Зах. України']],
                     ['Вівторок', ['1. Фізкультура', '2. Хімія', '3. Громадянська освіта', '4. Заруб. літ']],
                     ['Середа', ['1. Всесвітня історія', '2. Математика', '3. Біологія', '4. Основи правознавства']],
                     ['Четвер', ['1. Інформ. та обч. тех.', '2. Укр Мова', '3. Кресл./Іст України']],
                     ['П\'ятниця', ['1. Захист України', '2. Фізика', '3. Укр. Літ']]
                  ]
               ],
               ['ПК-11', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['ПК-12', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['БO-11', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['ДЗ-11', 
                  [
                     ['Понеділок', ['Фізика', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
            ]
         ],

            [2, [
               ['ПК-21', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['ПК-22', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['БO-21', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ]
            ]
         ],

            [3, [
               ['ПК-31', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['ПК-32', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['БO-31', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ]
            ]
         ],

            [4, [
               ['ПК-41', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['ПК-42', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ],
               ['БO-41', 
                  [
                     ['Понеділок', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']],
                     ['Вівторок', ['Укр літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Середа', ['Заруб літ', 'Математика', 'Інформатика', 'Програмування']],
                     ['Четвер', ['Фізкультура', 'Математика', 'Інформатика', 'Програмування']],
                     ['П\'ятниця', ['Укр мова', 'Математика', 'Інформатика', 'Програмування']]
                  ]
               ]
            ]
         
         ]
      ]



      return (
         <div className='dayTimeTable_page'>
            { this.props.isLoginned ?  <div>
                  <h2 id='Top'>Розклад</h2>
                  <Link to='Top' smooth={true}><i class='bx bx-chevron-up up'></i></Link>
                  <div className='scroll-menu'>
                     {timeTable.map((tTable) => tTable[1].map((ttabl) => <Link className='scroll-menu-link' to={ttabl[0]} smooth={true} duration={1000} >{ttabl[0]}</Link>))}
                  </div>
                  <div className="table_container">
                     {timeTable.map((tTable) => <div>
                        <h3>{tTable[0]} КУРС</h3>
                        <GroupTimeTable groups={tTable[1]} />
                     </div>
                     )}

                     
                  </div>
               </div> : (<Login />)}
         </div>
      );
   }
}

export default Timetablestudentpage;

